Catalogs/РекламныеБлокиПечатныхФорм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>РекламныеБлокиПечатныхФорм</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВыводитьРекламуВШапке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьРекламуВПодвале</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РекламныеБлокиШапка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПрисоединенныйФайл</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РекламныеБлокиПечатныхФормПрисоединенныеФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РекламныеБлокиПодвал</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПрисоединенныйФайл</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РекламныеБлокиПечатныхФормПрисоединенныеФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ДаНет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ДаНет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Да</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ХарактеристикиНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.КатегорииНоменклатуры</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Артикул характеристики</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КиЗГИСМGTIN</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКартинки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатурыПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/РекламныеБлокиПечатныхФорм/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

#Область Печать

// Сформировать печатные формы объектов.
//
// Параметры:
//  МассивОбъектов - Массив - массив ссылок на объекты которые нужно распечатать (входящий),
//  ПараметрыПечати - Структура - структура дополнительных параметров печати (входящий),
//  КоллекцияПечатныхФорм - ТаблицаЗначений - Сформированные табличные документы (исходящий),
//  ОбъектыПечати - СписокЗначений - объекты печати, в поле "Значение" передается ссылка на объект,
//                     в поле "Представление" имя области, в которой был выведен объект (исходящий),
//  ПараметрыВывода - Структура - параметры сформированных табличных документов (исходящий).
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм,
		"ПредварительныйПросмотрПечатнойФормыСчетНаОплату");
	Если ПечатнаяФорма <> Неопределено Тогда
	
		ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
		ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = Обработки.ПечатьСчетНаОплату.КлючПараметровПечати();
		ПечатнаяФорма.ПолныйПутьКМакету = Обработки.ПечатьСчетНаОплату.ПолныйПутьКМакету();
		ПечатнаяФорма.СинонимМакета = Обработки.ПечатьСчетНаОплату.ПредставлениеПФ(Ложь);
	
		ДанныеОбъектовПечати = УниверсальныйЗапросПоДаннымДокумента(МассивОбъектов);
		Обработки.ПечатьСчетНаОплату.СформироватьПФ(ПечатнаяФорма, ДанныеОбъектовПечати, ОбъектыПечати, Ложь);
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

// Функция возвращает параметры рекламных блоков по документу
//
// Параметры:
//  СсылкаНаДокумента	 - ДокументСсылка	 - Документ с реквизитом рекламного блока
// 
// Возвращаемое значение:
//  Структура - Параметры рекламного блока и сами файлы с картинками
//
Функция ПараметрыРекламныхБлоковПоДокументу(СсылкаНаДокумент) Экспорт
	
	ПараметрыРекламногоБлока = Новый Структура;
	ПараметрыРекламногоБлока.Вставить("ВыводитьРекламуВШапке", Ложь);
	ПараметрыРекламногоБлока.Вставить("ВыводитьРекламуВПодвале", Ложь);
	ПараметрыРекламногоБлока.Вставить("РекламныйБлокВШапке", Неопределено);
	ПараметрыРекламногоБлока.Вставить("РекламныйБлокВПодвале", Неопределено);
	
	// Для предварительного просмотра из самого справочника
	Если ТипЗнч(СсылкаНаДокумент) = Тип("СправочникСсылка.РекламныеБлокиПечатныхФорм") Тогда
		РекламныйБлок = СсылкаНаДокумент;
	Иначе
		Если НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СсылкаНаДокумент, "РекламныйБлокПечтаныхФорм") Тогда
			Возврат ПараметрыРекламногоБлока;
		КонецЕсли;
		
		РекламныйБлок = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаДокумент, "РекламныйБлокПечтаныхФорм");
		
		Если НЕ ЗначениеЗаполнено(РекламныйБлок) Тогда
			Возврат ПараметрыРекламногоБлока;
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РекламныеБлокиПечатныхФорм.ВыводитьРекламуВШапке КАК ВыводитьРекламуВШапке,
		|	РекламныеБлокиПечатныхФорм.ВыводитьРекламуВПодвале КАК ВыводитьРекламуВПодвале
		|ИЗ
		|	Справочник.РекламныеБлокиПечатныхФорм КАК РекламныеБлокиПечатныхФорм
		|ГДЕ
		|	РекламныеБлокиПечатныхФорм.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РекламныеБлокиПечатныхФормРекламныеБлокиШапка.Ссылка КАК Ссылка,
		|	РекламныеБлокиПечатныхФормРекламныеБлокиШапка.НомерСтроки КАК НомерСтроки,
		|	РекламныеБлокиПечатныхФормРекламныеБлокиШапка.ПрисоединенныйФайл КАК ПрисоединенныйФайл
		|ИЗ
		|	Справочник.РекламныеБлокиПечатныхФорм.РекламныеБлокиШапка КАК РекламныеБлокиПечатныхФормРекламныеБлокиШапка
		|ГДЕ
		|	РекламныеБлокиПечатныхФормРекламныеБлокиШапка.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РекламныеБлокиПечатныхФормРекламныеБлокиПодвал.Ссылка КАК Ссылка,
		|	РекламныеБлокиПечатныхФормРекламныеБлокиПодвал.НомерСтроки КАК НомерСтроки,
		|	РекламныеБлокиПечатныхФормРекламныеБлокиПодвал.ПрисоединенныйФайл КАК ПрисоединенныйФайл
		|ИЗ
		|	Справочник.РекламныеБлокиПечатныхФорм.РекламныеБлокиПодвал КАК РекламныеБлокиПечатныхФормРекламныеБлокиПодвал
		|ГДЕ
		|	РекламныеБлокиПечатныхФормРекламныеБлокиПодвал.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", РекламныйБлок);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[0].Выбрать();
	
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	
	Если Выборка.Следующий() Тогда
		
		Если Выборка.ВыводитьРекламуВШапке Тогда
			БаннерыШапки = РезультатЗапроса[1].Выгрузить();
			Если БаннерыШапки.Количество() > 0 Тогда
				НомерБаннера = ГСЧ.СлучайноеЧисло(0, БаннерыШапки.Количество()-1);
				СсылкаНаФайл = БаннерыШапки[НомерБаннера].ПрисоединенныйФайл;
				Если ЗначениеЗаполнено(СсылкаНаФайл) Тогда
					ПараметрыРекламногоБлока.РекламныйБлокВШапке = СсылкаНаФайл;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если Выборка.ВыводитьРекламуВПодвале Тогда
			БаннерыПодвала = РезультатЗапроса[2].Выгрузить();
			Если БаннерыПодвала.Количество() > 0 Тогда
				НомерБаннера = ГСЧ.СлучайноеЧисло(0, БаннерыПодвала.Количество()-1);
				СсылкаНаФайл = БаннерыПодвала[НомерБаннера].ПрисоединенныйФайл;
				Если ЗначениеЗаполнено(СсылкаНаФайл) Тогда
					ПараметрыРекламногоБлока.РекламныйБлокВПодвале = СсылкаНаФайл;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		ПараметрыРекламногоБлока.ВыводитьРекламуВШапке = Выборка.ВыводитьРекламуВШапке
								И ПараметрыРекламногоБлока.РекламныйБлокВШапке <> Неопределено;
		ПараметрыРекламногоБлока.ВыводитьРекламуВПодвале = Выборка.ВыводитьРекламуВПодвале
								И ПараметрыРекламногоБлока.РекламныйБлокВПодвале <> Неопределено;
		
	КонецЕсли;
	
	Возврат ПараметрыРекламногоБлока;
	
КонецФункции

// Процедура вызывается в момент заполнения нового документа для подстановки рекламного блока
//
// Параметры:
//  ОбъектЗаполнения - ДокументОбъект	 - Создаваемый документ
//
Процедура ОбработкаЗаполненияРекламногоБлокаВДокументе(ОбъектЗаполнения) Экспорт
	
	МетаданныеОбъекта = ОбъектЗаполнения.Метаданные();
	
	Если НЕ ОбщегоНазначения.ЕстьРеквизитОбъекта("РекламныйБлокПечтаныхФорм", МетаданныеОбъекта)
		ИЛИ НЕ ОбщегоНазначения.ЕстьРеквизитОбъекта("Организация", МетаданныеОбъекта) Тогда
		Возврат;
	КонецЕсли;
	
	БлокИзНастроек = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеНастройки("РекламныйБлокСчетаЗаказа", ОбъектЗаполнения.Организация);
	
	Если ЗначениеЗаполнено(БлокИзНастроек) Тогда
		ОбъектЗаполнения.РекламныйБлокПечтаныхФорм = БлокИзНастроек;
	Иначе
		БлокИзОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектЗаполнения.Организация, "РекламныйБлокПечтаныхФорм");
		ОбъектЗаполнения.РекламныйБлокПечтаныхФорм = БлокИзОрганизации;
	КонецЕсли;
	
КонецПроцедуры

// Функция получает рекламный блок при изменении организации
//
// Параметры:
//  Организация	 - СправочникСсылка.Организация	 - Организация в документе
// 
// Возвращаемое значение:
//  СправочникСсылка.РекламныеБлокиПечатныхФорм - Рекламный блок по организации или настройкам пользователя
//
Функция ПолучитьРекламныйБлок(Организация) Экспорт

	БлокИзНастроек = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеНастройки("РекламныйБлокСчетаЗаказа", Организация);
	
	Если ЗначениеЗаполнено(БлокИзНастроек) Тогда
		Возврат БлокИзНастроек;
	Иначе
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "РекламныйБлокПечтаныхФорм");
	КонецЕсли;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Печать

Функция УниверсальныйЗапросПоДаннымДокумента(МассивОбъектов)
	
	Организация = Справочники.Организации.ОсновнаяОрганизация;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ДатаДокумента", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Номер", "00000000001");
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ОрганизацияЮридическоеФизическоеЛицо", Организация.ЮридическоеФизическоеЛицо);
	Запрос.УстановитьПараметр("Префикс", Организация.Префикс);
	Запрос.УстановитьПараметр("БанковскийСчет", Организация.БанковскийСчетПоУмолчанию);
	Запрос.УстановитьПараметр("ФайлЛоготип", Организация.ФайлЛоготип);
	Запрос.УстановитьПараметр("ФайлФаксимильнаяПечать", Организация.ФайлФаксимильнаяПечать);
	Запрос.УстановитьПараметр("ДолжностьРуководителя", Организация.ПодписьРуководителя.Должность);
	Запрос.УстановитьПараметр("РасшифровкаПодписиРуководителя",
		Организация.ПодписьРуководителя.РасшифровкаПодписи);
	Запрос.УстановитьПараметр("ФаксимилеПодписиРуководителя", Организация.ПодписьРуководителя.Факсимиле);
	Запрос.УстановитьПараметр("РуководительДолжность", Организация.ПодписьРуководителя.Должность);
	Запрос.УстановитьПараметр("РуководительРасшифровкаПодписи",
		Организация.ПодписьРуководителя.РасшифровкаПодписи);
	Запрос.УстановитьПараметр("РуководительФаксимилеПодписи", Организация.ПодписьРуководителя.Факсимиле);
	Запрос.УстановитьПараметр("ГлавныйБухгалтерДолжность", Организация.ПодписьГлавногоБухгалтера.Должность);
	Запрос.УстановитьПараметр("ГлавныйБухгалтерРасшифровкаПодписи",
		Организация.ПодписьГлавногоБухгалтера.РасшифровкаПодписи);
	Запрос.УстановитьПараметр("ГлавныйБухгалтерФаксимиле", Организация.ПодписьГлавногоБухгалтера.Факсимиле);
	Запрос.УстановитьПараметр("ВалютаДокумента", Константы.НациональнаяВалюта.Получить());
	Запрос.УстановитьПараметр("Контрагент", Справочники.Контрагенты.ПустаяСсылка());
	Запрос.УстановитьПараметр("Договор", НСтр("ru ='Договор № 000001 от 30.12.1922'"));
	Запрос.УстановитьПараметр("ОснованиеПечати", НСтр("ru ='Договор № 000001 от 30.12.1922'"));
	Запрос.УстановитьПараметр("ЗапасДляПредварительногоПросмотра", НСтр("ru = 'Запас для предварительного просмотра'"));
	Запрос.УстановитьПараметр("Артикул", НСтр("ru = 'АРТ-0000001'"));
	Запрос.УстановитьПараметр("ЕдиницаИзмерения", НСтр("ru = 'шт.'"));
	Запрос.УстановитьПараметр("РекламныйБлокПечтаныхФорм", МассивОбъектов[0]);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	&РекламныйБлокПечтаныхФорм КАК Ссылка,
	|	&ДатаДокумента КАК ДатаДокумента,
	|	&Номер КАК Номер,
	|	&Организация КАК Организация,
	|	&ОрганизацияЮридическоеФизическоеЛицо КАК ОрганизацияЮридическоеФизическоеЛицо,
	|	&Префикс КАК Префикс,
	|	&БанковскийСчет КАК БанковскийСчет,
	|	&ФайлЛоготип КАК ФайлЛоготип,
	|	&ФайлФаксимильнаяПечать КАК ФаксимилеПечати,
	|	Неопределено КАК Подразделение,
	|	Значение(Перечисление.ДаНет.Да) КАК ИспользоватьФаксимиле,
	|	&РуководительДолжность КАК ДолжностьРуководителя,
	|	&РуководительРасшифровкаПодписи КАК РасшифровкаПодписиРуководителя,
	|	&РуководительРасшифровкаПодписи КАК РасшифровкаПодписиВыполнилРаботыУслуги,
	|	&РуководительФаксимилеПодписи КАК ФаксимилеРуководителя,
	|	&ГлавныйБухгалтерДолжность КАК ДолжностьГлавногоБухгалтера,
	|	&ГлавныйБухгалтерРасшифровкаПодписи КАК РасшифровкаПодписиГлавногоБухгалтера,
	|	&ГлавныйБухгалтерФаксимиле КАК ФаксимилеГлавногоБухгалтера,
	|	ИСТИНА КАК СуммаВключаетНДС,
	|	&ВалютаДокумента КАК ВалютаДокумента,
	|	&Контрагент КАК Контрагент,
	|	&Договор КАК Договор,
	|	Неопределено КАК ДополнительныеУсловия,
	|	Неопределено КАК ДокументОснование,
	|	Неопределено КАК Ответственный,
	|	Неопределено КАК ФизическоеЛицоОтветственного,
	|	Неопределено КАК Автор,
	|	Неопределено КАК ДисконтнаяКарта,
	|	Неопределено КАК ПроцентСкидкиПоДисконтнойКарте,
	|	Неопределено КАК Комментарий,
	|	&ОснованиеПечати КАК ОснованиеПечати,
	|	Неопределено КАК ОснованиеПечатиСсылка,
	|	Неопределено КАК ТаблицаЗапасы,
	|	Неопределено КАК ТаблицаПланаОплат,
	|	ЛОЖЬ КАК ОжидаетсяВыборВариантаКП,
	|	&РекламныйБлокПечтаныхФорм КАК РекламныйБлокПечтаныхФорм";

	ТаблицаСчета = Запрос.Выполнить().Выгрузить();

	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК НомерСтроки,
	|	&ЗапасДляПредварительногоПросмотра КАК ПредставлениеНоменклатуры,
	|	Неопределено КАК Характеристика,
	|	&Артикул КАК Артикул,
	|	""0000000001"" КАК Код,
	|	&ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	118 КАК Цена,
	|	118 КАК Сумма,
	|	18 КАК СуммаНДС,
	|	118 КАК Всего,
	|	1 КАК Количество,
	|	Неопределено КАК Содержание,
	|	0 КАК ПроцентСкидкиНаценки,
	|	0 КАК ЕстьСкидка,
	|	0 КАК СуммаАвтоматическойСкидки,
	|	ЛОЖЬ КАК ЭтоРазделитель,
	|	ЛОЖЬ КАК ЭтоНабор,
	|	ЛОЖЬ КАК НеобходимоВыделитьКакСоставНабора,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК НоменклатураНабора,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаНабора,
	|	0 КАК СуммаБезСкидки";

	ТаблицаСчета[0].ТаблицаЗапасы = Запрос.Выполнить().Выгрузить();

	Запрос.Текст =
	"ВЫБРАТЬ
	|	0 КАК ПроцентОплаты,
	|	0 КАК СуммаОплаты,
	|	0 КАК СуммаНДСОплаты";

	ТаблицаСчета[0].ТаблицаПланаОплат = Запрос.Выполнить().Выгрузить();

	Возврат ТаблицаСчета;

КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
